lab/frost/doc/frost.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 01:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FrostAV: Distributed System</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lewis Collum" />
</head>
<body>
<div id="content">
<h1 class="title">FrostAV: Distributed System</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga141a21">1. Unsorted References</a>
<ul>
<li><a href="#org83f88aa">1.1. Embedded Distributed Systems</a></li>
<li><a href="#org63ff871">1.2. Qt</a></li>
<li><a href="#orgfb09aba">1.3. Communication</a></li>
<li><a href="#org3144393">1.4. AVR</a></li>
<li><a href="#org3dcc585">1.5. Dependency Injection</a></li>
</ul>
</li>
<li><a href="#orge12310e">2. Level 1</a>
<ul>
<li><a href="#org2712afd">2.1. MVP Specifications</a></li>
<li><a href="#orgb3924c5">2.2. Development</a>
<ul>
<li><a href="#org208206f">2.2.1. <span class="todo TODO">TODO</span> Networked OpenCV <code>[0/6]</code>                                      :CV:E:L1.1:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge9761cc">3. plan</a>
<ul>
<li><a href="#orgc9bc9f8">3.1. August 31</a></li>
<li><a href="#orge8d3d73">3.2. December 13</a></li>
</ul>
</li>
<li><a href="#org58cc5b3">4. Communication's Level of Abstraction</a></li>
<li><a href="#orgca43e38">5. Mechanical System</a></li>
<li><a href="#org7980f2c">6. Power System</a>
<ul>
<li><a href="#org19a7a39">6.1. Motor Supply (Dirty)</a></li>
<li><a href="#orgcacbac4">6.2. Logic Supply (Clean)</a></li>
</ul>
</li>
<li><a href="#org7a1565a">7. Robotic System</a>
<ul>
<li><a href="#orgcc4ccae">7.1. Drive System (Control)</a>
<ul>
<li><a href="#org251d1bf">7.1.1. Drive Manager</a></li>
<li><a href="#org9a33700">7.1.2. Speed Controller</a></li>
<li><a href="#org3c5964d">7.1.3. Steer Controller</a></li>
<li><a href="#org403808d">7.1.4. Quadrature Encoder</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Keywords:  Distributed System, Sensor Network
</p>

<div id="outline-container-orga141a21" class="outline-2">
<h2 id="orga141a21"><span class="section-number-2">1</span> Unsorted References</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org83f88aa" class="outline-3">
<h3 id="org83f88aa"><span class="section-number-3">1.1</span> Embedded Distributed Systems</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://www.kth.se/social/upload/745/IS_GuestLecture_DistributedSystems_201009020.pdf">https://www.kth.se/social/upload/745/IS_GuestLecture_DistributedSystems_201009020.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org63ff871" class="outline-3">
<h3 id="org63ff871"><span class="section-number-3">1.2</span> Qt</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://doc.qt.io/qt-5/qtgui-openglwindow-example.html">https://doc.qt.io/qt-5/qtgui-openglwindow-example.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfb09aba" class="outline-3">
<h3 id="orgfb09aba"><span class="section-number-3">1.3</span> Communication</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/I%C2%B2C">https://en.wikipedia.org/wiki/I²C</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3144393" class="outline-3">
<h3 id="org3144393"><span class="section-number-3">1.4</span> AVR</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://www.avrfreaks.net/sites/default/files/Reduced.pdf">https://www.avrfreaks.net/sites/default/files/Reduced.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3dcc585" class="outline-3">
<h3 id="org3dcc585"><span class="section-number-3">1.5</span> Dependency Injection</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Dependency_injection#UML_class_and_sequence_diagram">https://en.wikipedia.org/wiki/Dependency_injection#UML_class_and_sequence_diagram</a></li>
<li><a href="https://stackoverflow.com/questions/557742/dependency-injection-vs-factory-pattern">https://stackoverflow.com/questions/557742/dependency-injection-vs-factory-pattern</a></li>
<li><a href="https://adam.younglogic.com/2008/07/dependency-injection-in-c/">https://adam.younglogic.com/2008/07/dependency-injection-in-c/</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge12310e" class="outline-2">
<h2 id="orge12310e"><span class="section-number-2">2</span> Level 1</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2712afd" class="outline-3">
<h3 id="org2712afd"><span class="section-number-3">2.1</span> MVP Specifications</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>1</li>
<li>2</li>
</ol>
</div>
</div>

<div id="outline-container-orgb3924c5" class="outline-3">
<h3 id="orgb3924c5"><span class="section-number-3">2.2</span> Development</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org208206f" class="outline-4">
<h4 id="org208206f"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> Networked OpenCV <code>[0/6]</code>                                      :CV:E:L1.1:</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> OpenCV</li>
<li class="off"><code>[&#xa0;]</code> PS3Eye -&gt; OpenCV</li>
<li class="off"><code>[&#xa0;]</code> PS3Eye -&gt; UDP</li>
<li class="off"><code>[&#xa0;]</code> PS3Eye -&gt; OpenCV -&gt; UDP
<ul class="org-ul">
<li>Pipe toString to ffmpeg</li>
<li>C++ socket (client: ffmpeg to view stream)
<ul class="org-ul">
<li>OpenCV Publisher -&gt; CVSocket Subscriber, CVState Subscriber [do not implement in this development level]</li>
</ul></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> PS3Eye -&gt; OpenCV -&gt; UDP -&gt; OpenGL</li>
<li class="off"><code>[&#xa0;]</code> PS3Eye -&gt; OpenCV -&gt; UDP -&gt; Qt -&gt; OpenGL</li>
<li>References:
<ul class="org-ul">
<li><a href="https://lembergsolutions.com/blog/how-process-live-video-stream-using-ffmpeg-and-opencv">https://lembergsolutions.com/blog/how-process-live-video-stream-using-ffmpeg-and-opencv</a></li>
<li><a href="https://amin-ahmadi.com/2018/03/29/how-to-read-process-and-display-videos-using-qt-and-opencv/">https://amin-ahmadi.com/2018/03/29/how-to-read-process-and-display-videos-using-qt-and-opencv/</a></li>
<li><a href="https://stackoverflow.com/questions/20314524/c-opencv-image-sending-through-socket">https://stackoverflow.com/questions/20314524/c-opencv-image-sending-through-socket</a></li>
<li><a href="https://stackoverflow.com/questions/43440915/what-ways-do-i-have-to-stream-opencv-output-to-my-own-remote-c-gui?rq=1">https://stackoverflow.com/questions/43440915/what-ways-do-i-have-to-stream-opencv-output-to-my-own-remote-c-gui?rq=1</a></li>
<li><a href="https://docs.opencv.org/2.4/doc/tutorials/introduction/load_save_image/load_save_image.html">https://docs.opencv.org/2.4/doc/tutorials/introduction/load_save_image/load_save_image.html</a></li>
<li><a href="https://stackoverflow.com/questions/38585504/displaying-a-stream-of-images-with-qt">https://stackoverflow.com/questions/38585504/displaying-a-stream-of-images-with-qt</a></li>
<li><a href="https://stackoverflow.com/questions/47600680/qt5-multiple-opengl-widgets-in-the-same-window">https://stackoverflow.com/questions/47600680/qt5-multiple-opengl-widgets-in-the-same-window</a></li>
<li><a href="https://www.raspberrypi.org/forums/viewtopic.php?p=91076">Playstation PS3 Eye Streaming (Pi)</a></li>
<li><a href="http://htonoyan.blogspot.com/2015/05/using-ps3-eye-toy-with-opencv.html?m=1">http://htonoyan.blogspot.com/2015/05/using-ps3-eye-toy-with-opencv.html?m=1</a></li>
<li><a href="https://answers.opencv.org/question/72546/cant-use-ps3-eye-with-opencv/">https://answers.opencv.org/question/72546/cant-use-ps3-eye-with-opencv/</a></li>
<li><a href="https://subscription.packtpub.com/book/application_development/9781784399757/1/ch01lvl1sec12/supercharging-the-playstation-eye">Linux OpenCV with Eye</a></li>
<li><a href="http://lakm.us/logit/2012/11/simple-ffmpeg-udp-video-streaming-from-beagleboard-running-ubuntu/">http://lakm.us/logit/2012/11/simple-ffmpeg-udp-video-streaming-from-beagleboard-running-ubuntu/</a></li>
<li><a href="https://stackoverflow.com/questions/50916903/how-to-process-vlc-udp-stream-over-opencv">https://stackoverflow.com/questions/50916903/how-to-process-vlc-udp-stream-over-opencv</a></li>
<li><a href="https://www.raspberrypi.org/forums/viewtopic.php?t=193033">PS3eye from 100fps to 187fps with Pi ZeroW</a></li>
<li><a href="https://stackoverflow.com/questions/7669240/webcam-streaming-using-gstreamer-over-udp">https://stackoverflow.com/questions/7669240/webcam-streaming-using-gstreamer-over-udp</a></li>
<li><a href="https://docs.opencv.org/3.0-beta/doc/py_tutorials/py_gui/py_video_display/py_video_display.html">https://docs.opencv.org/3.0-beta/doc/py_tutorials/py_gui/py_video_display/py_video_display.html</a></li>
<li><a href="https://stackoverflow.com/questions/5825173/pipe-raw-opencv-images-to-ffmpeg">https://stackoverflow.com/questions/5825173/pipe-raw-opencv-images-to-ffmpeg</a></li>
<li><a href="https://doc.qt.io/qt-5/qtopengl-cube-example.html">https://doc.qt.io/qt-5/qtopengl-cube-example.html</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>






<div id="outline-container-orge9761cc" class="outline-2">
<h2 id="orge9761cc"><span class="section-number-2">3</span> plan</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc9bc9f8" class="outline-3">
<h3 id="orgc9bc9f8"><span class="section-number-3">3.1</span> August 31</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>frostE: Simulation Engine
<ul class="org-ul">
<li>Upload video to server, from which the vehicle will practice.</li>
</ul></li>
<li>frostCV: OpenCV object detection</li>
<li>frostAVR: Metaprogramming AVR Libraries</li>
<li>frostCAD: CAD Models</li>
<li>List of required devices
<ul class="org-ul">
<li>RPi3 B+ [camera vision] w/ Arch Linux Arm</li>
<li>AVR's [control]</li>
<li>RPi0W [networking] [remove if RPi3 B+ is capable]</li>
<li>peripherals
<ul class="org-ul">
<li>memory</li>
<li>h-bridge</li>
<li>encoder</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge8d3d73" class="outline-3">
<h3 id="orge8d3d73"><span class="section-number-3">3.2</span> December 13</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Chassis</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org58cc5b3" class="outline-2">
<h2 id="org58cc5b3"><span class="section-number-2">4</span> Communication's Level of Abstraction</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Low
<ul class="org-ul">
<li>Measurement: raw sensor data (no interpretation)</li>
<li>Control: direct peripheral commands (e.g. 0-255 pwm for ESC)</li>
</ul></li>
<li>Medium
<ul class="org-ul">
<li>Measurement: interpreted (e.g. encoder module would give velocity in m/s)</li>
<li>Control: interpreted peripheral command (e.g. drive at 1 m/s)</li>
</ul></li>
<li>High
<ul class="org-ul">
<li>Measurement: state, measurement [stores relevant portion of previous state]</li>
<li>Control: state, control</li>
</ul></li>

<li>State Mediator, each slave provides relevant portion of the state</li>
</ul>
</div>
</div>

<div id="outline-container-orgca43e38" class="outline-2">
<h2 id="orgca43e38"><span class="section-number-2">5</span> Mechanical System</h2>
</div>

<div id="outline-container-org7980f2c" class="outline-2">
<h2 id="org7980f2c"><span class="section-number-2">6</span> Power System</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org19a7a39" class="outline-3">
<h3 id="org19a7a39"><span class="section-number-3">6.1</span> Motor Supply (Dirty)</h3>
</div>
<div id="outline-container-orgcacbac4" class="outline-3">
<h3 id="orgcacbac4"><span class="section-number-3">6.2</span> Logic Supply (Clean)</h3>
</div>
</div>

<div id="outline-container-org7a1565a" class="outline-2">
<h2 id="org7a1565a"><span class="section-number-2">7</span> Robotic System</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgcc4ccae" class="outline-3">
<h3 id="orgcc4ccae"><span class="section-number-3">7.1</span> Drive System (Control)</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>What does a request from the global system look like?
<ul class="org-ul">
<li>Should navigation be handled or not?
No. A potential "Navigation System" would handle navigation and
interface with the Drive System. If we wanted to switch the
robot to fully manual control (essentially, an RC car) then we
would want to bypass navigational control.</li>
<li>Otherwise, would this system take a speed and an angle as an input parameter?</li>
</ul></li>
<li>How should calibration be administered?
<ul class="org-ul">
<li>Should calibration be manual?
No. Each system within the Global System should have the
ability to learn, such that there is no need for manual
calibration. This encourages a self-reliant Global System. For
example, the Steer Controller can learn from the analog value
of the steering servo's potentiometer and from a gyroscope.
<ul class="org-ul">
<li>How can we preserve loose coupling if the Drive System needs
other system to learn?</li>
</ul></li>
</ul></li>
<li>Does a gyroscope give sufficient feedback to steer the vehicle straight?
<ul class="org-ul">
<li>Should the Drive System use a global gyroscope or its own?
Using a global gyroscope would make the Drive System dependent
on another system. This increases coupling, thereby reducing
the ability to reuse the Drive System. While our vehicle may
contain a global gyroscope, other robotic systems may not.</li>
</ul></li>
<li>How can the vehicle learn its speed?
<ul class="org-ul">
<li>A Bayes filter would be needed since we cannot directly measure speed.</li>
<li>A motor encoder can provide a rotational velocity that is
proportional to the wheels velocity.</li>
<li>An accelerometer and gyroscope can provide global acceleration.</li>
</ul></li>
<li>How can the vehicle learn its steering angle?
<ul class="org-ul">
<li>The analog value from the steering servo's potentiometer is the
variable to be tuned.</li>
<li>A gyroscope can provide a rate of rotation.</li>
<li>Limit switches can be used to find the angle limits.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org251d1bf" class="outline-4">
<h4 id="org251d1bf"><span class="section-number-4">7.1.1</span> Drive Manager</h4>
</div>
<div id="outline-container-org9a33700" class="outline-4">
<h4 id="org9a33700"><span class="section-number-4">7.1.2</span> Speed Controller</h4>
</div>
<div id="outline-container-org3c5964d" class="outline-4">
<h4 id="org3c5964d"><span class="section-number-4">7.1.3</span> Steer Controller</h4>
<div class="outline-text-4" id="text-7-1-3">
</div>
<ol class="org-ol">
<li><a id="orgb1708a7"></a>Gyroscope<br /></li>
</ol>
</div>
<div id="outline-container-org403808d" class="outline-4">
<h4 id="org403808d"><span class="section-number-4">7.1.4</span> Quadrature Encoder</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lewis Collum</p>
<p class="date">Created: 2019-06-24 Mon 01:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
